app/controllers/news_controller.rb

SELECT `news`.* FROM `news`
---
  def index
    @news = News.all

INSERT INTO `news` (`shoeName`, `smallText`, `largeText`, `releaseDate`, `price`, `color`, `created_at`, `updated_at`) VALUES ('adidas black', 'nosemeocurrenada', 'nosemeocurrenadamaslargo', '2018-12-16 19:50:00', 955, 'brown', '2018-12-16 19:52:10', '2018-12-16 19:52:10')
---
  def create
    @news = News.new(news_params)
    @news.images.attach(params[:news][:images])

DELETE FROM `news` WHERE `news`.`id` = 1
---
  def destroy
    @news.destroy

SELECT  `news`.* FROM `news` WHERE `news`.`id` = 0 LIMIT 1
---
  def set_news
    @news = News.find(params[:id])