app/controllers/shoes_controller.rb

  def index
    @shoes = Shoe.search(params[:term])
---
SELECT `shoes`.* FROM `shoes` WHERE (brand LIKE '%nike%' or model LIKE '%nike%' ORDER BY created_at)

  def admin_shoe
    @shoes = Shoe.all
---
SELECT `shoes`.* FROM `shoes`

  def create
    @shoe = Shoe.new(shoe_params)
    @shoe.image.attach(params[:shoe][:image])
---
INSERT INTO `shoes` (`brand`, `color`, `model`, `price`, `releaseDate`, `info`) VALUES ('Adidas', 'Core black', 'Yeezy 350 v2', 615, '2018-12-15 00:00:00', 'unas yeezy negras jodidamente overpriced')

  def update
    respond_to do |format|
      if @shoe.update(shoe_params)
---
UPDATE `shoes` SET `price` = 800, `info` = 'unas preciosas de un negro para un negro' WHERE `shoes`.`shoesID` = 1

    def set_shoe
      @shoe = Shoe.find(params[:id])
---
SELECT  `shoes`.* FROM `shoes` WHERE `shoes`.`shoesID` = 11 LIMIT 1