app/models/user.rb

SELECT  `users`.* FROM `users` WHERE (lower(username) = 'admin' OR lower(email) = 'admin') ORDER BY `users`.`id` ASC LIMIT 1
---
  def self.find_for_database_authentication warden_conditions
    conditions = warden_conditions.dup
    login = conditions.delete(:login)
    where(conditions).where(["lower(username) = :value OR lower(email) = :value", {value: login.strip.downcase}]).first